*** DONE Description of results from the shock simulations
CLOSED: [2024-12-13 Fri 08:24]
- A cooling rate of 30 is required to get the Mach numbers to come out right for the low-velocity shocks and quasi-shocks
- For the quasi-shocks (isothermal M_0 = 1 to sqrt(\gamma) \approx 1.3), we see a smooth transition on scale of the cooling length, with T initially rising and then falling
  - The peak T is quite small though, for instance
    |  M_i |   M_a |  T_max |    T_1 |
    |-----+------+-------+-------|
    | 1.1 | 0.85 | 1.013 |       |
    | 1.2 | 0.93 |  1.03 |       |
    | 1.3 | 1.01 |  1.06 | 1.007 |
    | 1.4 | 1.08 |  1.11 |  1.08 |
    | 1.5 | 1.16 |  1.17 |  1.16 |
    |   2 | 1.55 |  1.55 |  1.55 |
    |   3 | 2.32 |   2.5 |   2.5 |
    |     |      |       |       |
#+TBLFM: $2=$1 / sqrt(5/3) ; f2
*** DONE Estimating the isothermal Mach number of the fully-radiative shock
CLOSED: [2024-12-10 Tue 19:41]
- For cases where we cool right down to the equilibrium temperature after the shock, with zero velocity, then the total velocity change across the isothermal shock is equal to the inflow velocity, and should be equal to the isothermal sound speed (1 in code units) times $M_0 - M_0^{-1}$, where $M_0$ is the isothermal Mach number of the shock.
- So M^2 - U M - 1 = 0
- M = 0.5 (U + sqrt(U^2 + 4))
- M = 0.5 U (1 + sqrt(1 + 4/U^2))
- Table
  |    U |      M |   M_ad | \rho_1/\rho_0 |  \rho_2/\rho_0 |  T_1/T_0 |  U_exp | Check |
  |------+--------+-------+--------+---------+--------+-------+-------|
  | 0.01 |  1.005 | 0.778 |  1.000 |   1.010 |  1.000 | 0.995 | 0.995 |
  |  0.1 |  1.051 | 0.814 |  1.000 |   1.105 |  1.000 | 0.951 | 0.951 |
  |  0.2 |  1.105 | 0.856 |  1.000 |   1.221 |  1.000 | 0.905 | 0.905 |
  |  0.3 |  1.161 | 0.899 |  1.000 |   1.348 |  1.000 | 0.861 | 0.861 |
  |  0.4 |  1.220 | 0.945 |  1.000 |   1.488 |  1.000 | 0.820 | 0.820 |
  |  0.5 |  1.281 | 0.992 |  1.000 |   1.641 |  1.000 | 0.781 | 0.781 |
  |  0.6 |  1.344 | 1.041 |  1.061 |   1.806 |  1.041 | 0.744 | 0.744 |
  |  0.7 |  1.409 | 1.091 |  1.136 |   1.985 |  1.089 | 0.709 | 0.710 |
  |  0.8 |  1.477 | 1.144 |  1.215 |   2.182 |  1.141 | 0.677 | 0.677 |
  |  0.9 |  1.547 | 1.198 |  1.294 |   2.393 |  1.193 | 0.647 | 0.646 |
  |  1.0 |  1.618 | 1.253 |  1.374 |   2.618 |  1.246 | 0.618 | 0.618 |
  |  1.5 |  2.000 | 1.549 |  1.778 |   4.000 |  1.547 | 0.500 | 0.500 |
  |  2.0 |  2.414 | 1.870 |  2.153 |   5.827 |  1.914 | 0.414 | 0.414 |
  |  3.0 |  3.303 | 2.558 |  2.743 |  10.910 |  2.891 | 0.303 | 0.303 |
  |  5.0 |  5.193 | 4.022 |  3.374 |  26.967 |  5.919 | 0.193 | 0.193 |
  | 10.0 | 10.099 | 7.823 |  3.813 | 101.990 | 19.997 | 0.099 | 0.099 |
  #+TBLFM: $2=0.5 ($1 + sqrt($1**2 + 4));f3::$3=$2/sqrt(5/3);f3::$4=$3<1?1.0:4 $3**2 / ($3**2 + 3);f3::$5=$2**2;f3::$6=$3<1?1.0:(1/16) (5 $3**2 - 1) (1 + 3/$3**2);f3::$7=$2 - $1;f3::$8=$2/$5;f3

  
